app/Helpers/CiFunction_helper.php

    function get_user()
    {
        if (CIauth::check()) {
            $user  = new User();
            return $user->asObject()->where('id', CIauth::id())->first();
---
SELECT *
FROM `users`
WHERE `id` = '2'
 LIMIT 1