app/Controllers/MainController.php

    public function index()
    {
        $user = CiAuth::user();
        $role = $user->role;
        $userId = $user->id;

        $projectModel = new Project();

        switch ($role) {
            case 'ppk':
                $projects = $projectModel->where('ppk_id', $userId)->findAll();
                break;

            case 'kontraktor':
                $projects = $projectModel->where('kontraktor_id', $userId)->findAll();
                break;

            case 'konsultan':
                $projects = $projectModel->where('konsultan_id', $userId)->findAll();
---
SELECT *
FROM `projects`
WHERE `konsultan_id` = '4'

    public function pagePemeriksaan()
    {
        $projectModel = new Project();
        $projects = $projectModel->findAll();
---
SELECT *
FROM `projects`

    public function getFileAndPemeriksaan($fileId)
    {
        $sertifikatModel = new Sertifikat();
        $pemeriksaanModel = new Pemeriksaan();
        $dokumenPendukungModel = new Dokumen();
        $fileData = $sertifikatModel->find($fileId);
        if (!$fileData) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'File sertifikat tidak ditemukan'
            ]);
        }

        $baseUrl = base_url();

        // Siapkan data file utama dengan URL lengkap
        $files = [
            'sertifikat_bulanan' => ['url' => $fileData['file_sertifikat'] ? $baseUrl . $fileData['file_sertifikat'] : null],
            'file_kuantitas' => ['url' => $fileData['file_kuantitas'] ? $baseUrl . $fileData['file_kuantitas'] : null],
            'file_kualitas' => ['url' => $fileData['file_kualitas'] ? $baseUrl . $fileData['file_kualitas'] : null],
        ];

        // Ambil data pemeriksaan sebelumnya untuk tiap file utama
        $pemeriksaanData = [];
        foreach ($files as $jenisFile => $file) {
            if ($file['url'] === null) {
                continue;
            }

            $pemeriksaan = $pemeriksaanModel
                ->where('sertifikat_id', $fileId)
                ->where('jenis_file', $jenisFile)
                ->orderBy('tanggal_pemeriksaan', 'DESC')
                ->first();
---
SELECT *
FROM `sertifikat`
WHERE `sertifikat`.`id` = '26'
SELECT *
FROM `pemeriksaan`
WHERE `sertifikat_id` = '26'
AND `jenis_file` = 'sertifikat_bulanan'
ORDER BY `tanggal_pemeriksaan` DESC
 LIMIT 1

    public function saveMultiple()
    {
        $request = $this->request;
        $pemeriksaanModel = new Pemeriksaan();
        $catatanRevisiModel = new CatatanRevisi();
        $fileModel = new Sertifikat();

        $fileId = $request->getPost('file_id');
        $userId = CiAuth::id();

        // Ambil sertifikat_id dari file
        $fileData = $fileModel->find($fileId);
---
SELECT *
FROM `sertifikat`
WHERE `sertifikat`.`id` = '25'


            if ($existingPemeriksaan) {
                // Update data pemeriksaan yang sudah ada
                $pemeriksaanModel->update($existingPemeriksaan['id'], $dataPemeriksaan);
                $pemeriksaanId = $existingPemeriksaan['id'];
            } else {
                // Insert data pemeriksaan baru
                $pemeriksaanModel->insert($dataPemeriksaan);
---
UPDATE `pemeriksaan` SET `sertifikat_id` = '25', `jenis_file` = 'sertifikat_bulanan', `pemeriksa_id` = '4', `status_pemeriksaan` = 'disetujui', `tanggal_pemeriksaan` = '2025-06-07 14:04:36', `catatan_umum` = NULL
WHERE `pemeriksaan`.`id` IN ('30')
INSERT INTO `pemeriksaan` (`sertifikat_id`, `jenis_file`, `pemeriksa_id`, `status_pemeriksaan`, `tanggal_pemeriksaan`, `catatan_umum`) VALUES ('25', 'sertifikat_bulanan', '4', 'ditolak', '2025-06-07 13:58:27', 'catatan revisi bulanan')

                    $catatanRevisiModel->update($existingCatatan['id'], $dataCatatan);
                } else {
                    // Insert catatan revisi baru
                    $catatanRevisiModel->insert($dataCatatan);
---
INSERT INTO `catatan_revisi` (`pemeriksaan_id`, `file_name`, `catatan`, `dibuat_oleh`, `tanggal_catatan`, `created_at`, `updated_at`) VALUES (30, 'sertifikat_bulanan', 'catatan revisi bulanan', '4', '2025-06-07 13:58:27', '2025-06-07 13:58:27', '2025-06-07 13:58:27')

    public function getLaporanRiwayat()
    {
        $pemeriksaanModel = new \App\Models\Pemeriksaan();
        $catatanRevisiModel = new \App\Models\CatatanRevisi();
        $sertifikatModel = new \App\Models\Sertifikat();
        $userModel = new \App\Models\User();

        // Ambil data sertifikat + proyek + kontraktor sekaligus
        $builder = $this->db->table('sertifikat s')
            ->select('
            s.id as sertifikat_id,
            pr.name as proyek,
            u_kon.name as kontraktor,
            s.bulan,
            s.tahun,
            s.file_sertifikat,
            s.file_kuantitas,
            s.file_kualitas,
            s.status as status_sertifikat
        ')
            ->join('projects pr', 's.project_id = pr.id')
            ->join('users u_kon', 's.kontraktor_id = u_kon.id')
            ->orderBy('pr.name', 'ASC')
            ->orderBy('s.tahun', 'DESC')
            ->orderBy('s.bulan', 'DESC');
---
SELECT `s`.`id` as `sertifikat_id`, `pr`.`name` as `proyek`, `u_kon`.`name` as `kontraktor`, `s`.`bulan`, `s`.`tahun`, `s`.`file_sertifikat`, `s`.`file_kuantitas`, `s`.`file_kualitas`, `s`.`status` as `status_sertifikat`
FROM `sertifikat` `s`
JOIN `projects` `pr` ON `s`.`project_id` = `pr`.`id`
JOIN `users` `u_kon` ON `s`.`kontraktor_id` = `u_kon`.`id`
ORDER BY `pr`.`name` ASC, `s`.`tahun` DESC, `s`.`bulan` DESC

        function formatTanggalIndonesia($tgl)
        {
            $bulan = [
                1 => 'Januari', 2 => 'Februari', 3 => 'Maret', 4 => 'April',
                5 => 'Mei', 6 => 'Juni', 7 => 'Juli', 8 => 'Agustus',
                9 => 'September', 10 => 'Oktober', 11 => 'November', 12 => 'Desember'
            ];
            $dateObj = date_create($tgl);
            if (!$dateObj) return $tgl;
            $day = $dateObj->format('d');
            $month = intval($dateObj->format('m'));
            $year = $dateObj->format('Y');
            return $day . ' ' . $bulan[$month] . ' ' . $year;
        }

        foreach ($sertifikats as $sertifikat) {
            $pemeriksaanList = $pemeriksaanModel->where('sertifikat_id', $sertifikat['sertifikat_id'])->findAll();

            // Fungsi mengambil status pemeriksaan per tipe file
            $getStatusByFile = function ($tipe_file) use ($pemeriksaanList, $userModel) {
                foreach ($pemeriksaanList as $p) {
                    if ($p['jenis_file'] == $tipe_file) {
                        $namaPemeriksa = $userModel->find($p['pemeriksa_id']);
---
SELECT *
FROM `pemeriksaan`
WHERE `sertifikat_id` = '25'
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

    public function tableLaporan()
    {
        $columns = [
            [
                'db' => 'id',
                'dt' => 0,
            ],
            [
                'db' => 'name',
                'dt' => 1,
            ],
            [
                'db' => 'kontraktor_id',
                'dt' => 2,
                'formatter' => function ($d, $row) {
                    $userModel = new User();
                    $name = $userModel->find($d);
                    return ucfirst($name['name']);
                }
            ],
            [
                'db' => 'id',
                'dt' => 3,
                'formatter' => function ($d, $row) {
                    $projectModel = new Project();
                    $projectData = $projectModel->find($d);
                    $start = date('m/Y', strtotime($projectData['start_date']));
                    $end = isset($projectData['end_date']) ? date('m/Y', strtotime($projectData['end_date'])) : '-';
                    return $start . ' s/d ' . $end;
                }
            ],
---
SELECT *
FROM `users`
WHERE `users`.`id` = 3
SELECT *
FROM `projects`
WHERE `projects`.`id` = 6